<?php
require_once dirname(__DIR__).'/app.php';
page_start('TOband-R3');
?>
<h1>TOband-R3</h1>
<section>
<h2>●ゲーム本体</h2>
<a href="<?=RELEASE_URL?>">ダウンロード（Windows）</a><br>
<a href="<?=SOURCE_URL?>">開発・ソースコード・過去バージョン（GitHub）</a>
</section>
<section>
<h2>●バージョン履歴</h2>
<h3>TOband-R3 2026-10-04</h3>
<div id="release-history" style="white-space: pre-wrap; overflow-wrap: anywhere;">TOband-R3をリリースしました。

1)仲間システムを追加
・＠は自分を含め最大３名編成
・最初は１名、アルモリカ城・バルマムッサの虐殺のクリアで仲間をそれぞれ１名ずつ追加
・自宅でaコマンドで仲間が加えられる
・自宅でTコマンドでトレーニング可能、自分－１レベル（最大３０レベル）まで
・仲間とはUコマンドで仲間を選んで交代、もしくはYコマンドで次の仲間に交代
・仲間が打撃系だと+1支援攻撃・射撃系だと追加射撃・魔法系だとMP・消費行動-10%
・mコマンドで仲間の魔法も使用可能、ただし行動エネルギーを倍消費する
・操作中ではない仲間もHP・MPが回復していく
・仲間が死亡すると残った仲間に交代し装備は床に落ちる、更にタロットカードが落ちる
・パーティのうち１名のみが上級職に転職できる　ドルガルア撃破で２人、天界制覇で３人に変更
・上級職の仲間は３５レベルが上限　ドルガルア撃破で４５、天界制覇で５０に変更
・リザレクション・リーンカーネイト・ネクロマンシー・マーティライズは仲間を対象に変更

2)ダンジョン『魔界』を追加
・旧時代の遺跡127階のカオスゲート上でブリュンヒルドを発動すると転移できる
・恐ろしく強力なオウガ系統をOシンボルに追加、魔界でのみ頻繁に出現し他ではレア
・アーティファクトのオウガシリーズはオウガだけがドロップする可能性がある
・魔界では暗黒の神々が固定階層を守っている　耐性を貫通する危険な特殊攻撃を持つ
　
3)クラス『テンプルコマンド』を追加
・テンプルナイトの上位職
・自分を含む仲間３人全員がテンプルナイトであることが転職条件（テンプルナイトは非上級職扱い）
・自分で命名できるランダム効果の必殺技（射程２マス近接攻撃）を習得可能

4)クラス『ダークエレメント』を追加
・魔界の施設でのみ転職可能　仲間を生贄に捧げて転職する
・転職した瞬間に全民族のカオスフレーム-300
・非常に強力な能力と特技を持つ

5)クラス『レリクスナイト』を変更
・転職条件を仲間が２人とも死亡済みである状態でオウガシリーズのうち１つを装備に変更
・移動時に壁を掘り進む、更に永久壁も5%で掘り進む
・攻撃回数を強化

6)ランダムユニークモンスターを変更
・生成ロジックは幻想蛮怒を参考、ただし出現率は幻想蛮怒の約３倍に
・命名ロジックを&lt;&lt;二つ名&gt;&gt;の&lt;&lt;名前&gt;&gt;式に変更　二つ名で能力が変化

7)その他
・スコアサーバーを実装　スコアは仲間が１人増えるごとに半分になる
・視界内モンスター表示機能を追加
・フェアノールのランプをイシュタルのランプに変更、+腕
・エレメント操作の効果を１０倍に変更
・天界・魔界から帰還可能に変更</div>
</section>
<section>
<h2>●スコアサーバー</h2>
<a href="/score/">新着順</a><br>
<a href="/score/?view=rank">スコア順</a><br>
<a href="/score/?view=win">勝利者</a><br>
<a href="/score/?view=stats">統計情報</a>
</section>
<section>
<h2>●リンク</h2>
<a href="/">TOband-R3 Wiki</a>
</section>
<section>
<h2>●開発</h2>
変愚蛮怒：変愚蛮怒開発チーム<br>
TOband2：TOband検討委員会<br>
TOband-R3：れんどる
</section>
<?php page_end(); ?>
